Конфигурация/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <attributes>
    <name>ТипКласса</name>
    <comment>(Документ, справочник и т.д.)</comment>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧРеквизиты</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСтруктураТаблиц</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧРеквизитыТаблиц</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧКоманды</name>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействияАлгоритма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/CommonModules/РаботаСФормами/Module.bsl
#Область рар_РаботаСФормами

// Работа с формами. Программное изменение элементов формы
//
// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Область ПрограммныйИнтерфейс

// Выполняет добавление или изменение элементов формы
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт

	Если Форма.ИмяФормы = "Справочник.Классы.Форма.ФормаКласса" Тогда
		
		ОбновитьЭлементыФормы_Справочник_Классы_ФормаЭлемента(Форма);  
					
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
// 	ТекущийОбъект - ДокументОбъект, СправочникОбъект - 
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт

	//Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
	//	
	//	ПриЧтенииНаСервере_Справочник_Контрагенты_ФормаЭлемента(Форма, ТекущийОбъект);
	//	
	//КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
// 	ТекущийОбъект - ДокументОбъект, СправочникОбъект - записанный объект.
// 	ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт

	//Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
	//	
	//	ПослеЗаписиНаСервере_Справочник_Контрагенты_ФормаЭлемента(Форма, ТекущийОбъект, ПараметрыЗаписи);
	//	
	//КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Отказ                - Булево - признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//  Форма                - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты, Форма) Экспорт
	
	//Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
	//	
	//	ОбработкаПроверкиЗаполненияНаСервере_Справочник_Контрагенты_ФормаЭлемента(Отказ, ПроверяемыеРеквизиты, Форма);
	//	
	//КонецЕсли;
	
КонецПроцедуры

// Создает группу формы по переданным параметрам
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ГруппаФормы - группа формы
//
Функция СоздатьГруппу(Форма, Имя, Родитель, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт
	
	ЭлементФормы = СоздатьЭлементФормы(Форма, Имя, Тип("ГруппаФормы"), Родитель, ЭлементПеред);
		
	УстановитьСвойстваЭлементу(ЭлементФормы, Свойства);
	УстановитьСобытияЭлементу(ЭлементФормы, События);
	
	Возврат ЭлементФормы;
	
КонецФункции 

// Создает поле формы по переданным параметрам
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ПолеФормы - новое поле формы
//
Функция СоздатьПоле(Форма, Имя, Родитель, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт
	
	ЭлементФормы = СоздатьЭлементФормы(Форма, Имя, Тип("ПолеФормы"), Родитель, ЭлементПеред);
		
	УстановитьСвойстваЭлементу(ЭлементФормы, Свойства);
	УстановитьСобытияЭлементу(ЭлементФормы, События);
	
	Возврат ЭлементФормы;
	
КонецФункции 

// Создает поле формы вида "ПолеВвода" по переданным параметрам
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ПутьКДанным		- Строка - данные, с которыми связан элемент
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ПолеФормы - новое поле формы
//
Функция СоздатьПолеВвода(Форма, Имя, Родитель, ПутьКДанным, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт
	
	СвойстваПоля	= Новый Структура;
	СвойстваПоля.Вставить("Вид"			, ВидПоляФормы.ПолеВвода);
	СвойстваПоля.Вставить("ПутьКДанным"	, ПутьКДанным);
	
	Если Свойства <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СвойстваПоля, Свойства, Ложь);
	КонецЕсли;
	
	Возврат СоздатьПоле(Форма, Имя, Родитель, ЭлементПеред, СвойстваПоля, События);
	
КонецФункции  

// [+] # [rarus kzn] Администратор 2025-02-20 {
// Краткое описание назначения изменений.

// Создает поле формы вида "ПолеНадписи" по переданным параметрам
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ПутьКДанным		- Строка - данные, с которыми связан элемент
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ПолеФормы - новое поле формы
//
Функция СоздатьПолеНадписи(Форма, Имя, Родитель, ПутьКДанным, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт
	
	СвойстваПоля	= Новый Структура;
	СвойстваПоля.Вставить("Вид"			, ВидПоляФормы.ПолеНадписи);
	СвойстваПоля.Вставить("ПутьКДанным"	, ПутьКДанным);
	
	Если Свойства <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СвойстваПоля, Свойства, Ложь);
	КонецЕсли;
	
	Возврат СоздатьПоле(Форма, Имя, Родитель, ЭлементПеред, СвойстваПоля, События);
	
КонецФункции

// } # [rarus kzn] Администратор 2025-02-20 }


// Краткое описание назначения изменений.
// Создает поле формы вида "ПолеФлажка" по переданным параметрам
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ПутьКДанным		- Строка - данные, с которыми связан элемент
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ПолеФормы - новое поле формы
//
Функция СоздатьПолеФлажка(Форма, Имя, Родитель, ПутьКДанным, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт
	
	СвойстваПоля	= Новый Структура;
	СвойстваПоля.Вставить("Вид"			, ВидПоляФормы.ПолеФлажка);
	СвойстваПоля.Вставить("ПутьКДанным"	, ПутьКДанным);
	
	Если Свойства <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СвойстваПоля, Свойства, Ложь);
	КонецЕсли;
	
	Возврат СоздатьПоле(Форма, Имя, Родитель, ЭлементПеред, СвойстваПоля, События);
	
КонецФункции

// Создает кнопку формы по переданным параметрам.
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	КнопкаФормы - новая кнопка формы
//
Функция СоздатьКнопку(Форма, Имя, Родитель, ЭлементПеред = Неопределено, Свойства = Неопределено) Экспорт 
	
	ЭлементФормы = СоздатьЭлементФормы(Форма, Имя, Тип("КнопкаФормы"), Родитель, ЭлементПеред);
		
	УстановитьСвойстваЭлементу(ЭлементФормы, Свойства);
	
	Возврат ЭлементФормы;
	
КонецФункции 

// Создает таблицу формы по переданным параметрам
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ТаблицаФормы - новый элемент формы
//
Функция СоздатьТаблицуФормы(Форма, Имя, Родитель, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт
	
	ЭлементФормы = СоздатьЭлементФормы(Форма, Имя, Тип("ТаблицаФормы"), Родитель, ЭлементПеред);
		
	УстановитьСвойстваЭлементу(ЭлементФормы, Свойства);
	УстановитьСобытияЭлементу(ЭлементФормы, События);
	
	Возврат ЭлементФормы;
	
КонецФункции 

// Создает декорацию формы по переданным параметрам.
//
// Параметры:
//	Форма 			- ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	Имя	 			- Строка - имя нового элемента 
//	Родитель		- ГруппаФормы, ТаблицаФормы, Строка	- группа формы (куда поместить)
//	ЭлементПеред	- ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - элемент перед которым нужно вставить новое поле
//	Свойства		- Структура - свойства элемента формы которые нужно инициализировать
//	События			- Структура - события элемента формы которые нужно инициализировать
//
// Возвращаемое значение:
//	ДекорацияФормы - новый элементы формы
//
Функция СоздатьДекорацию(Форма, Имя, Родитель, ЭлементПеред = Неопределено, Свойства = Неопределено, События = Неопределено) Экспорт 
	
	ЭлементФормы = СоздатьЭлементФормы(Форма, Имя, Тип("ДекорацияФормы"), Родитель, ЭлементПеред);
		
	УстановитьСвойстваЭлементу(ЭлементФормы, Свойства);
	УстановитьСобытияЭлементу(ЭлементФормы, События);
	
	Возврат ЭлементФормы;
	
КонецФункции 

// Создает реквизиты формы
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик. 
//  Реквизиты - РеквизитФормы, Массив - данные типа РеквизитФормы для добавления на форму
//
Процедура СоздатьРеквизиты(Форма, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) <> Тип("Массив") Тогда
		ДобавляемыеРеквизиты	= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Реквизиты);
	Иначе
		ДобавляемыеРеквизиты	= Реквизиты;	
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
КонецПроцедуры

// Создает команду формы
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//	ИмяКоманды - Строка - Имя команды
//  Заголовок - Строка - Заголовок команды
//  ИмяДействия - Строка - Имя процедуры действия команды
//
// Возвращаемое значение:
//	КомандаФормы - новая команда формы
//
Функция СоздатьКоманду(Форма, ИмяКоманды, Заголовок, ИмяДействия) Экспорт
	
	КомандаФормы	= Форма.Команды.Найти(ИмяКоманды);
	
	Если КомандаФормы = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = Заголовок;
		КомандаФормы.Действие = ИмяДействия;
	КонецЕсли;
	
	Возврат КомандаФормы;
	
КонецФункции

// Возвращает свойства обычной группы формы без отображения
// 
// Возвращаемое значение:
//  Структура - свойства группы формы
//
Функция СвойстваОбычнойГруппыБезОтображения() Экспорт

	Результат	= Новый Структура;
	
	Результат.Вставить("Вид"				, ВидГруппыФормы.ОбычнаяГруппа);
	Результат.Вставить("ОтображатьЗаголовок", Ложь);
	Результат.Вставить("Отображение"		, ОтображениеОбычнойГруппы.Нет);
	
	Возврат Результат;
	
КонецФункции

// Создает реквизит формы с типом динамический список
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения	 - форма, для которой выполняется обработчик.
//  Имя				 - Строка	 - имя реквизита формы.
//  ОсновнаяТаблица	 - Строка, Неопределено	 - имя основной таблицы динамического списка.
//  ТекстЗапроса	 - Строка, Неопределено - текст запроса динамического списка.
//  ПараметрыЗапроса - Структура, Неопределено	 - параметры запроса динамического списка.
//
Процедура СоздатьРеквизитДинамическийСписок(Форма, Имя, ОсновнаяТаблица = Неопределено, ТекстЗапроса = Неопределено, ПараметрыЗапроса = Неопределено) Экспорт
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = Новый Структура;
	КонецЕсли;
	 
	СоздатьРеквизиты(Форма, РеквизитФормы(Имя, ОписаниеТипаДинамическийСписок())); 
	
	Реквизит = Форма[Имя];
	
	Реквизит.ТекстЗапроса 		= ТекстЗапроса;
	Реквизит.ПроизвольныйЗапрос = ЗначениеЗаполнено(ТекстЗапроса);
	Реквизит.ОсновнаяТаблица 	= ОсновнаяТаблица;
	
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Реквизит, Параметр.Ключ, Параметр.Значение); 
	КонецЦикла;
	
КонецПроцедуры

#Область ОписаниеТипов

// Создание описания типа Строка
//
// Параметры:
//  ДлинаСтроки - Число - длина строки
//
Функция ОписаниеТипаСтрока(ДлинаСтроки = 0) Экспорт
	Возврат Новый ОписаниеТипов("Строка",,кСтрока(ДлинаСтроки));
КонецФункции

// Создание описания типа Число
//
// Параметры:
//  ДлинаЧисла - Число - общая длина числа
//	ТочностьЧисла - Число - количество символов после запятой
//
Функция ОписаниеТипаЧисло(ДлинаЧисла = 15,ТочностьЧисла = 2) Экспорт
	Возврат Новый ОписаниеТипов("Число",кЧисло(ДлинаЧисла,ТочностьЧисла));
КонецФункции

// Создание описания типа ДатаВремя
//
// Параметры:
//  ДатаВремя - Строка - Варианты: "ДатаВремя", "Дата" или "Время"
//
Функция ОписаниеТипаДатаВремя(ДатаВремя = "ДатаВремя") Экспорт
	Возврат Новый ОписаниеТипов("Дата",,,кДатаВремя(ДатаВремя));
КонецФункции

// Создание типа "Таблица значений"
Функция ОписаниеТипаТаблицаЗначений() Экспорт
	
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	Возврат Новый ОписаниеТипов(МассивТипаВыбора);	
	
КонецФункции

// Создание типа "Динамический список"
Функция ОписаниеТипаДинамическийСписок() Экспорт
	
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ДинамическийСписок"));
	Возврат Новый ОписаниеТипов(МассивТипаВыбора);	
	
КонецФункции

// Создание типа "Булево"
Функция ОписаниеТипаБулево() Экспорт
	
	Возврат Новый ОписаниеТипов("Булево");	
	
КонецФункции

// Создание описания ссылочного типа справочника
//
// Параметры:
//  ИмяДокумента - Строка - Имя документа в дереве метаданных
//
Функция ОписаниеТипаДокумент(ИмяДокумента) Экспорт
	
	Возврат Новый ОписаниеТипов("ДокументСсылка." + ИмяДокумента);	
	
КонецФункции

// Создание описания ссылочного типа справочника
//
// Параметры:
//  ИмяСправочника - Строка - Имя справочника в дереве метаданных
//
Функция ОписаниеТипаСправочник(ИмяСправочника) Экспорт
	
	Возврат Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочника);	
	
КонецФункции

// Создание описания типа перечисление
//
// Параметры:
//  ИмяПеречисления - Строка - Имя перечисления в дереве метаданных
//
Функция ОписаниеТипаПеречисление(ИмяПеречисления) Экспорт
	
	Возврат Новый ОписаниеТипов("ПеречислениеСсылка." + ИмяПеречисления);	
	
КонецФункции

// Создание квалификатора для типа Строка
//
// Параметры:
//  ДлинаСтроки - Число - длина строки
//
Функция кСтрока(ДлинаСтроки = 0) Экспорт
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки);
КонецФункции

// Создание квалификатора для типа Число
//
// Параметры:
//  ДлинаЧисла - Число - общая длина числа
//	ТочностьЧисла - Число - количество символов после запятой
//
Функция кЧисло(ДлинаЧисла = 15,ТочностьЧисла = 2) Экспорт
	Возврат Новый КвалификаторыЧисла(ДлинаЧисла,ТочностьЧисла);
КонецФункции

// Создание квалификатора для типа ДатаВремя
//
// Параметры:
//  ДатаВремя - Строка - Варианты: "ДатаВремя", "Дата" или "Время"
//
Функция кДатаВремя(ДатаВремя = "ДатаВремя") Экспорт
	Возврат Новый КвалификаторыДаты(ЧастиДаты[ДатаВремя]);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДобавлениеИзменениеЭлементовФормы

Функция СоздатьЭлементФормы(Форма, Имя, ТипЭлемента, Знач Родитель, ЭлементПеред)
	
	ЭлементФормы = Форма.Элементы.Найти(Имя);
	
	Если ТипЗнч(Родитель) = Тип("Строка") Тогда
		Родитель	= Форма.Элементы.Найти(Родитель);	
	КонецЕсли;
	
	Если ЭлементФормы <> Неопределено Тогда
		Форма.Элементы.Переместить(ЭлементФормы, Родитель, ЭлементПеред);
	ИначеЕсли ЭлементПеред = Неопределено Тогда
		ЭлементФормы = Форма.Элементы.Добавить(Имя, ТипЭлемента, Родитель);
	Иначе
		ЭлементФормы = Форма.Элементы.Вставить(Имя, ТипЭлемента, Родитель, ЭлементПеред);
	КонецЕсли;
	
	Возврат ЭлементФормы;
	
КонецФункции

Процедура УстановитьСвойстваЭлементу(Элемент, Свойства)
	
	Если Свойства = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Свойство Из Свойства Цикл
		Элемент[Свойство.Ключ] = Свойство.Значение;	
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСобытияЭлементу(Элемент, События)
	
	Если События = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Событие Из События Цикл
		
		ОбработчикСобытия	= Элемент.ПолучитьДействие(Событие.Ключ);
		Если ЗначениеЗаполнено(ОбработчикСобытия) Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент.УстановитьДействие(Событие.Ключ, Событие.Значение);	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция РеквизитФормы(Имя, Тип, Путь = Неопределено, Заголовок = Неопределено, СохраняемыеДанные = Ложь)

	Возврат Новый РеквизитФормы(Имя, Тип, Путь, Заголовок, СохраняемыеДанные);
	
КонецФункции

#Область СправочникКлассы


Процедура ОбновитьЭлементыФормы_Справочник_Классы_ФормаЭлемента(Форма)     
	
	Объект	= Форма.Объект;
	
	СвойстваГруппы	= Новый Структура("Вид, Заголовок", ВидГруппыФормы.Страница, "Реквизиты класса");
	СтраницаРеквизитыКласса	= СоздатьГруппу(Форма, "СтраницаРеквизитыКласса", Форма.Элементы.Страницы, , СвойстваГруппы);
	
	Итерратор = 0;     
			
	Для каждого Реквизит из Объект.ТЧРеквизиты Цикл
				
		ДобавляемыеРеквизиты = Новый массив;     
		РеквизитФормы = РеквизитФормы("ТЧРеквизиты" + Строка(Итерратор), Новый ОписаниеТипов("Строка"), , Реквизит.ИмяРеквизита);
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		СвойстваПоля	= Новый Структура("Доступность , ТолькоПросмотр", Истина, Истина);
		СоздатьПолеВвода(Форма, "ЭлементТЧРеквизиты" + Строка(Итерратор), СтраницаРеквизитыКласса, "ТЧРеквизиты" + Строка(Итерратор), , СвойстваПоля);
		
		Итерратор = Итерратор +1;
		
	КонецЦикла;  

	Итерратор = 0;
	
	Для каждого Команда из Объект.ТЧКоманды Цикл
		
		
		СоздатьКоманду(Форма, "ТЧКоманды" + Строка(Итерратор), Команда.ИмяКоманды, "ТЧКоманды" + Строка(Итерратор)); 
		
		СвойстваПоля	= Новый Структура("ИмяКоманды", "ТЧКоманды" + Строка(Итерратор));
		СоздатьКнопку(Форма, "КнопкаТЧКоманды" + Строка(Итерратор), СтраницаРеквизитыКласса, , СвойстваПоля);
		
		Итерратор = Итерратор +1;
		
	КонецЦикла;
	
	Итерратор = 0;
	
	Для каждого стрСтруктураТаблиц из Объект.ТЧСтруктураТаблиц Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("ИмяТаблицы", стрСтруктураТаблиц.ИмяТаблицы);  
		
		СтрокиТЧРеквизитыТаблиц = Объект.ТЧРеквизитыТаблиц.НайтиСтроки(Отбор);
		
		СвойстваГруппы	= Новый Структура("Вид, Заголовок", ВидГруппыФормы.Страница, стрСтруктураТаблиц.ИмяТаблицы);
		СтраницаТаблица	= СоздатьГруппу(Форма, стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор), Форма.Элементы.Страницы, , СвойстваГруппы);
		
		ДобавляемыеРеквизиты = Новый массив;     
		РеквизитФормы = РеквизитФормы("ТЧСтруктураТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор), Новый ОписаниеТипов("ТаблицаЗначений"), , стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор));
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		Для каждого стр из СтрокиТЧРеквизитыТаблиц Цикл 
			
			РеквизитФормы = РеквизитФормы("ТЧРеквизитыТаблиц" + стр.ИмяТаблицы + стр.ИмяРеквизита + Строка(Итерратор), Новый ОписаниеТипов("Строка"), "ТЧСтруктураТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор), стр.ИмяРеквизита);
			ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
			
		КонецЦикла;
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		СвойстваТаблицы	= Новый Структура("ПутьКДанным", "ТЧСтруктураТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор));
		СоздатьТаблицуФормы(Форма, "ЭлементТЧСтруктураТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор), СтраницаТаблица, , СвойстваТаблицы);
		
		СвойстваПоля	= Новый Структура("Доступность , ТолькоПросмотр", Истина, Истина);
		Для каждого стр из СтрокиТЧРеквизитыТаблиц Цикл 
				
			СоздатьПолеВвода(Форма, 
							"ЭлементТЧРеквизитыТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + стр.ИмяРеквизита + Строка(Итерратор), 
							Форма.Элементы["ЭлементТЧСтруктураТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор)], 
							"ТЧСтруктураТаблиц" + стрСтруктураТаблиц.ИмяТаблицы + Строка(Итерратор) + "." + "ТЧРеквизитыТаблиц" + стр.ИмяТаблицы + стр.ИмяРеквизита + Строка(Итерратор), 
							, 
							СвойстваПоля);
		                
		КонецЦикла;     
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#КонецОбласти

// BSLLS:NestedFunctionInParameters-on
// BSLLS:EmptyRegion-on


#КонецОбласти
